source/_posts/2017-07-28-算法技巧-使用动态规划求解部分和问题.html
---
title: "算法技巧-使用动态规划求解部分和问题"
date: 2017-07-28
layout: post
categories: 
- 编程技巧
tags: 
- 编程技巧 
- 算法
published: true
comments: 
---

<div id="outline-container-org58b574a" class="outline-2">
<h2 id="org58b574a">部分和问题</h2>
<div class="outline-text-2" id="text-org58b574a">
<p>
在算法中，有一类常见的问题被称为部分和问题。
在这类问题中，你需要判断是否能够使用给定数组中的部分数，通过累加获得所要获得的目标和。
而对于每个候选数字，在有些题目中你只能使用一次，而在另一些题目中则可以多次使用。
在后面我们会看到，这两种情况都可以使用动态规划方法来求解，只不过具体的求解思路会有一些不同。
</p>
</div>
</div>
<div id="outline-container-orgb0ee185" class="outline-2">
<h2 id="orgb0ee185">Partition Equal Subset Sum</h2>
<div class="outline-text-2" id="text-orgb0ee185">
<pre class="example">
Given a non-empty array containing only positive integers, find if the array can be partitioned into two subsets such that the sum of elements in both subsets is equal.
</pre>

<p>
为了解决这个问题，首先假设我们将集合 nums 分成了满足条件的 A 和 B 这两个子集合，它们必然满足下面两个条件：
</p>

<p>
sum(A) = sum(B)
sum(A) + sum(B) = sum(nums)
</p>

<p>
使用前一个公式将后一个等式中的B替换为A，可得：
</p>

<p>
sum(A) = sum(nums)/2 
</p>

<p>
我们可以发现，这道题已经转化成了我们之前所讨论的部分和的问题了。
</p>

<p>
现在我们所要求解的是：是否能够从一个给定的数的集合选出一个子集合，这个子集合中元素的和为该集合中全部元素和的一半。
当然如果整个集合中所有元素的和为奇数的话，这个子集合肯定不存在。可以对这个条件提前进行判断，以减少不必要的计算。
</p>

<p>
如果整个集合中所有元素的和的一半为偶数的话，就需要使用动态规划方法来判断是否能够找到这样的子集合。
为了使用动态规划方法，我们构造了一个数组称为 oldp，其表示对于已经遍历过的数字，是否能在它们中找到所有元素的和等于该索引值的子集合。
</p>
<ul class="org-ul">
<li>初始化：在第一次迭代之前，只有索引为0的位置的值为True，其余均为False，条件为真。</li>
<li>保持：当遍历第i个数时，当且仅当j之前就能被部分和所表示或者j-i能被表示时，该遍历完成后j能被表示。</li>
<li>终止：oldp 中各个索引的值表示是否能用所给的数组的部分和来表示。</li>
</ul>

<p>
因此在完成所有数值的循环后，只需要查看索引为 half 的 oldp 即可知道是否能将整个数组分为两个元素和相等的集合。
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">canPartition</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>, nums<span style="color: #4f97d7;">)</span>:
    <span style="color: #2aa1ae;">"""</span>
<span style="color: #2aa1ae;">    :type nums: List[int]</span>
<span style="color: #2aa1ae;">    :rtype: bool</span>
<span style="color: #2aa1ae;">    """</span>
    <span style="color: #7590db;">sums</span> = <span style="color: #4f97d7;">sum</span><span style="color: #4f97d7;">(</span>nums<span style="color: #4f97d7;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> sums % <span style="color: #a45bad;">2</span> == <span style="color: #a45bad;">1</span>:
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">False</span>

    <span style="color: #7590db;">half</span> = sums / <span style="color: #a45bad;">2</span>
    <span style="color: #7590db;">oldp</span> = <span style="color: #4f97d7;">[</span><span style="color: #a45bad;">False</span><span style="color: #4f97d7;">]</span> * <span style="color: #4f97d7;">(</span>half + <span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span>
    <span style="color: #7590db;">oldp</span><span style="color: #4f97d7;">[</span><span style="color: #a45bad;">0</span><span style="color: #4f97d7;">]</span> = <span style="color: #a45bad;">True</span>

    <span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> nums:
        <span style="color: #4f97d7; font-weight: bold;">for</span> j <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span><span style="color: #4f97d7;">(</span>half, i-<span style="color: #a45bad;">1</span>, -<span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span>:
            <span style="color: #7590db;">oldp</span><span style="color: #4f97d7;">[</span>j<span style="color: #4f97d7;">]</span> = oldp<span style="color: #4f97d7;">[</span>j<span style="color: #4f97d7;">]</span> <span style="color: #4f97d7; font-weight: bold;">or</span> oldp<span style="color: #4f97d7;">[</span>j-i<span style="color: #4f97d7;">]</span>

    <span style="color: #4f97d7; font-weight: bold;">return</span> oldp<span style="color: #4f97d7;">[</span>half<span style="color: #4f97d7;">]</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org8bd4520" class="outline-2">
<h2 id="org8bd4520">Target Sum</h2>
<div class="outline-text-2" id="text-org8bd4520">
<pre class="example">
 You are given a list of non-negative integers, a1, a2, ..., an, and a target, S. Now you have 2 symbols + and -. For each integer, you should choose one from + and - as its new symbol.

Find out how many ways to assign symbols to make sum of integers equal to target S. 
</pre>

<p>
这道题目看起来和上一个题目相差很大，但是如果我们对题目所给的条件做一些适当的数学变化的话，
就会发现这道题目本质上也是个部分和的问题。
</p>

<p>
首先我们假设在这个集合中，正的子集合为P，负的为N。
然后我们就可以使用这两个符号将题目所包含的关系给表示出来：
</p>

<p>
sum(P) + sum(N) = sum(nums)
</p>

<p>
sum(P) - sum(N) = S
</p>

<p>
将这两个等式组合一下之后，我们可以发现该问题已经转换为部分和的问题了:
</p>

<p>
sum(P) = (sum(nums) + S)/2
</p>

<p>
这里一个比较大的不同就是：这个问题所求的是有多少种不同的部分和的结果和目标值相同，而上一题仅仅需要知道是否存在和目标值的部分和。
所以在这里，我们的 dp 表示的是存在多少种不同的部分和可以表示该索引值，此时的内层递推公式也相应的改成了:
</p>

<p>
dp[j] += dp[j-1]
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">findTargetSumWays</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>, nums, S<span style="color: #4f97d7;">)</span>:
    <span style="color: #2aa1ae;">"""</span>
<span style="color: #2aa1ae;">    :type nums: List[int]</span>
<span style="color: #2aa1ae;">    :type S: int</span>
<span style="color: #2aa1ae;">    :rtype: int</span>
<span style="color: #2aa1ae;">    """</span>
    <span style="color: #7590db;">target</span> = <span style="color: #4f97d7;">sum</span><span style="color: #4f97d7;">(</span>nums<span style="color: #4f97d7;">)</span> + S
    <span style="color: #4f97d7; font-weight: bold;">if</span> S &gt; <span style="color: #4f97d7;">sum</span><span style="color: #4f97d7;">(</span>nums<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">or</span> target % <span style="color: #a45bad;">2</span>:
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>
    <span style="color: #4f97d7; font-weight: bold;">else</span>:
        <span style="color: #7590db;">target</span> = target/<span style="color: #a45bad;">2</span>

    <span style="color: #7590db;">dp</span> = <span style="color: #4f97d7;">[</span><span style="color: #a45bad;">0</span><span style="color: #4f97d7;">]</span> * <span style="color: #4f97d7;">(</span>target+<span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span>
    <span style="color: #7590db;">dp</span><span style="color: #4f97d7;">[</span><span style="color: #a45bad;">0</span><span style="color: #4f97d7;">]</span> = <span style="color: #a45bad;">1</span>
    <span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> nums:
        <span style="color: #4f97d7; font-weight: bold;">for</span> j <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">reversed</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">range</span><span style="color: #bc6ec5;">(</span>i, target+<span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>:
            <span style="color: #7590db;">dp</span><span style="color: #4f97d7;">[</span>j<span style="color: #4f97d7;">]</span> += dp<span style="color: #4f97d7;">[</span>j-i<span style="color: #4f97d7;">]</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> dp<span style="color: #4f97d7;">[</span>target<span style="color: #4f97d7;">]</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf2a13b6" class="outline-2">
<h2 id="orgf2a13b6">Combination Sum IV</h2>
<div class="outline-text-2" id="text-orgf2a13b6">
<pre class="example">
Given an integer array with all positive numbers and no duplicates, find the number of possible combinations that add up to a positive integer target.
</pre>

<p>
需要注意的是，在这个题目中数组中的每个数字都可以使用多次，而不是像之前的题目所要求的只能使用一次。
为了能够满足这个条件，我们可以从1开始一直到目标值，依次尝试是否能够使用数组中的数来累加到所尝试的索引值。
因为数组中的数是大于等于1的，而我们对部分和目标值的搜索跨度为1，所以使用这种方法必定是不会错过数组集合中所有数值的任何一种可能的组合的。
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">combinationSum4</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>, nums, target<span style="color: #4f97d7;">)</span>:
    <span style="color: #2aa1ae;">"""</span>
<span style="color: #2aa1ae;">    :type nums: List[int]</span>
<span style="color: #2aa1ae;">    :type target: int</span>
<span style="color: #2aa1ae;">    :rtype: int</span>
<span style="color: #2aa1ae;">    """</span>
    <span style="color: #7590db;">d</span> = <span style="color: #4f97d7;">[</span><span style="color: #a45bad;">0</span><span style="color: #4f97d7;">]</span> * <span style="color: #4f97d7;">(</span>target+<span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span>
    <span style="color: #7590db;">d</span><span style="color: #4f97d7;">[</span><span style="color: #a45bad;">0</span><span style="color: #4f97d7;">]</span> = <span style="color: #a45bad;">1</span>
    <span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">1</span>,target+<span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span>:
        <span style="color: #4f97d7; font-weight: bold;">for</span> j <span style="color: #4f97d7; font-weight: bold;">in</span> nums:
            <span style="color: #4f97d7; font-weight: bold;">if</span> i &gt;= j:
                <span style="color: #7590db;">d</span><span style="color: #4f97d7;">[</span>i<span style="color: #4f97d7;">]</span> += d<span style="color: #4f97d7;">[</span>i-j<span style="color: #4f97d7;">]</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> d<span style="color: #4f97d7;">[</span>target<span style="color: #4f97d7;">]</span>
</pre>
</div>
</div>
</div>
